# Clase de Pandas: Manipulaci√≥n y An√°lisis de Datos

## Introducci√≥n a Pandas

Pandas es una biblioteca de Python especializada en el manejo y an√°lisis de estructuras de datos. Define nuevas estructuras de datos basadas en los arrays de la biblioteca NumPy, pero con funcionalidades adicionales. Esto significa que puedes aprovechar las capacidades de NumPy y agregar funcionalidades espec√≠ficas para el an√°lisis de datos.

### ¬øPor qu√© y para qu√© usar Pandas?

Pandas es la clave para organizar y dar forma a grandes conjuntos de datos. Nos permite:
*   **Explorar datos:** Cargar, examinar y obtener informaci√≥n b√°sica de un conjunto de datos.
*   **Manipular datos:** Filtrar, seleccionar y transformar datos, lo cual es esencial para la preparaci√≥n de datos.
*   **Preparar datos para el an√°lisis:** Limpiar y estructurar datos adecuadamente.

### Ventajas clave de Pandas:
*   **Flexibilidad:** Maneja una amplia variedad de formatos de datos, desde hojas de c√°lculo hasta bases de datos.
*   **Eficiencia:** Realiza operaciones de datos a gran escala de manera eficiente, optimizada para grandes vol√∫menes de datos.
*   **Integraci√≥n:** Se integra perfectamente con otras bibliotecas de an√°lisis de datos y visualizaci√≥n como NumPy y Matplotlib.
*   **Sintaxis amigable:** Ofrece una sintaxis clara y coherente.

### Estructuras de Datos Principales en Pandas

Pandas introduce tres estructuras de datos principales:
1.  **Series:** Una estructura de datos unidimensional, similar a un array o una columna en una tabla. Cada elemento tiene un √≠ndice asociado.
2.  **DataFrame:** Una estructura de datos bidimensional similar a una tabla de una base de datos o una hoja de c√°lculo. Consiste en una colecci√≥n de Series organizadas en columnas.
3.  **Panel:** Una estructura de datos tridimensional, menos com√∫n que las Series y los DataFrames.

Antes de empezar, necesitamos importar la librer√≠a Pandas:

In [1]:
# Importamos la librer√≠a pandas
import pandas as pd



## 1. Series en Pandas

Una Serie es una estructura de datos unidimensional en Pandas. Se puede pensar en ella como una columna en una tabla con etiquetas de √≠ndice.

### Caracter√≠sticas de las Series:
*   **Datos homog√©neos:** Contiene datos de un solo tipo (integers, floats, strings, etc.).
*   **√çndices etiquetados:** Cada elemento tiene una etiqueta de √≠ndice asociada. Los √≠ndices pueden ser personalizados o generados autom√°ticamente, permitiendo un acceso m√°s intuitivo.
*   **Funcionalidades adicionales:** Proporcionan numerosas funcionalidades para manipular y analizar datos eficientemente, como operaciones matem√°ticas, filtrado, agregaci√≥n, ordenamiento, etc..

### Creaci√≥n de Series

Podemos crear Series de diferentes formas: vac√≠as, a partir de listas, o a partir de diccionarios.

#### Serie Vac√≠a

In [2]:
# Creando una Serie vac√≠a
serie_vacia = pd.Series()

print("Mi serie de pandas es:", serie_vacia) 
print("Los tipos de elementos que la componen son:", serie_vacia.dtype)

Mi serie de pandas es: Series([], dtype: object)
Los tipos de elementos que la componen son: object

In [3]:
type(serie_vacia)

pandas.core.series.Series

In [4]:
serie_vacia.dtype

dtype('O')

In [5]:
# Creando una Serie vac√≠a
serie_vacia2 = pd.Series(dtype='int64')

print("Mi serie de pandas es:", serie_vacia2) 
print("Los tipos de elementos que la componen son:", serie_vacia2.dtype)

Mi serie de pandas es: Series([], dtype: int64)
Los tipos de elementos que la componen son: int64



#### Serie a partir de Listas

`pd.Series` genera autom√°ticamente un √≠ndice num√©rico consecutivo empezando por 0. Sin embargo, podemos personalizar los √≠ndices usando el par√°metro `index`. Los √≠ndices pueden ser de diferentes tipos (integer, cadenas, fechas, etc.) y no necesariamente tienen que estar en orden o ser consecutivos.

In [6]:
# Definimos una lista
lista = [3, 5, 7, 2, 4, 1, 5]

In [7]:
# Convertimos la lista en una Serie (√≠ndice autom√°tico)
serie_lista1 = pd.Series(lista) 
serie_lista1

0    3
1    5
2    7
3    2
4    4
5    1
6    5
dtype: int64

In [8]:
# Creamos una Serie con un √≠ndice personalizado (num√©rico)
serie_lista2 = pd.Series(lista, index=[5, 6, 7, 8, 9, 4, 3])
serie_lista2

5    3
6    5
7    7
8    2
9    4
4    1
3    5
dtype: int64

In [9]:
# Creamos una Serie con un √≠ndice personalizado (num√©rico)
serie_lista2 = pd.Series(lista, index=[5, 6, 7, 8, 9]) # El n√∫mero de elementos tiene que coincidir!!
serie_lista2

ValueError: Length of values (7) does not match length of index (5)

In [10]:
# Creamos una Serie con √≠ndices de tipo string
serie_lista3 = pd.Series([1, 2, 3, 4, 5], index=["Lunes", "Martes", "Miercoles", "Jueves", "Viernes"])
serie_lista3

Lunes        1
Martes       2
Miercoles    3
Jueves       4
Viernes      5
dtype: int64



#### Series a partir de Diccionarios

Cuando se crea una Serie a partir de un diccionario, las claves del diccionario se convierten en los √≠ndices de la Serie y los valores del diccionario se convierten en los valores de la Serie.

In [11]:
# Definir un diccionario
dicc = {
    'lorena': 10,
    'marta': 20,
    'pilar': 30,
    'laura': 50,
    'ana': 86,
    'maria': 28
}

In [12]:
# Crear una Serie nueva a partir del diccionario
serie_diccionario = pd.Series(dicc)
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64



### Propiedades de las Series

Las propiedades son atributos que proporcionan informaci√≥n sobre las caracter√≠sticas de una Serie.

In [13]:
# 1. .index: Devuelve los √≠ndices de la Serie
print(f"La propiedad '.index' nos devuelve los √≠ndices de la Serie: {serie_diccionario.index}")

La propiedad '.index' nos devuelve los √≠ndices de la Serie: Index(['lorena', 'marta', 'pilar', 'laura', 'ana', 'maria'], dtype='object')

In [ ]:
type(serie_diccionario.index) # Podemos convertir index a lista: list(serie_diccionario.index)

pandas.core.indexes.base.Index

In [17]:
for i in serie_diccionario.index:
    print(i)

lorena
marta
pilar
laura
ana
maria

In [19]:
# 2. .values: Devuelve los valores de la Serie como un array NumPy
print(f"La propiedad '.values' nos devuelve los valores de la Serie: {serie_diccionario.values}")

La propiedad '.values' nos devuelve los valores de la Serie: [10 20 30 50 86 28]

In [22]:
serie_diccionario.values

array([10, 20, 30, 50, 86, 28])

In [21]:
type(serie_diccionario.values)

numpy.ndarray

In [24]:
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64

In [23]:
# 3. .shape: Devuelve una tupla que representa la forma (dimensiones) de la Serie
print(f"La propiedad '.shape' nos devuelve la forma de la Serie: {serie_diccionario.shape}")

La propiedad '.shape' nos devuelve la forma de la Serie: (6,)

üîç ¬øQu√© significa exactamente (6,)?
Es una tupla con un solo elemento: 6

Indica que el array tiene 1 dimensi√≥n, y esa dimensi√≥n tiene longitud 6

El uso de la coma ((6,)) es intencional para diferenciarlo de un n√∫mero entre par√©ntesis como (6), que no es una tupla en Python

In [27]:
serie_diccionario.shape

(6,)

In [ ]:
type(serie_diccionario.shape)

tuple

In [28]:
# 4. .size: Devuelve el n√∫mero total de elementos en la Serie
print(f"La propiedad '.size' nos devuelve el n√∫mero de elementos de la Serie: {serie_diccionario.size}")

La propiedad '.size' nos devuelve el n√∫mero de elementos de la Serie: 6

In [29]:
serie_diccionario.size

6

In [32]:
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64

In [30]:
# 5. .dtype: Devuelve el tipo de datos de los elementos en la Serie
print(f"La propiedad '.dtype' nos devuelve el tipo de datos de la Serie: {serie_diccionario.dtype}")

La propiedad '.dtype' nos devuelve el tipo de datos de la Serie: int64



### Indexaci√≥n de las Series

La indexaci√≥n permite acceder a los elementos de una Serie utilizando √≠ndices o etiquetas.

*   **Indexaci√≥n por posici√≥n:** Acceder a elementos usando la posici√≥n num√©rica (como en las listas, empieza en 0).
*   **Indexaci√≥n por etiqueta:** Acceder a elementos usando las etiquetas de √≠ndice.
*   **Indexaci√≥n por rango:** Acceder a un rango de elementos.
*   **Indexaci√≥n por lista de √≠ndices:** Acceder a varios elementos espec√≠ficos mediante una lista.

In [33]:
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64

In [34]:
# Indexaci√≥n por posici√≥n
# Accedemos al primer elemento (valor 10)
serie_diccionario[0]

/var/folders/dc/5lb7jh9x1d317m9p99y8hjm40000gn/T/ipykernel_38029/3577276995.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  serie_diccionario[0]

10

In [35]:
# Accedemos al tercer elemento (valor 30)
serie_diccionario[2]

/var/folders/dc/5lb7jh9x1d317m9p99y8hjm40000gn/T/ipykernel_38029/3093163275.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  serie_diccionario[2]

30

In [36]:
# Indexaci√≥n por etiqueta
# Accedemos al valor de la etiqueta "laura" (valor 50)
serie_diccionario["laura"]

50

In [37]:
# Accedemos al valor de la etiqueta "pilar" (valor 30)
serie_diccionario["pilar"]

30

In [38]:
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64

In [39]:
# Indexaci√≥n por rango
# Accedemos a los elementos desde el √≠ndice de posici√≥n 1 al 3 (incluido el 3)
# Esto incluye los valores en las posiciones 1, 2 y 3 (marta, pilar, laura)
serie_diccionario[1:4]

marta    20
pilar    30
laura    50
dtype: int64

In [40]:
# Indexaci√≥n por lista de √≠ndices (posiciones)
# Acceder a los elementos con √≠ndices de posici√≥n 0, 2 y 3 (lorena, pilar, laura)
# Fijaos en los dos corchetes '[[...]]'
serie_diccionario[[0, 2, 3]]

/var/folders/dc/5lb7jh9x1d317m9p99y8hjm40000gn/T/ipykernel_38029/3150543989.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  serie_diccionario[[0, 2, 3]]

lorena    10
pilar     30
laura     50
dtype: int64

### Acceder a elementos de una Series en Pandas con `.iloc` y `.loc`

En Pandas, es importante distinguir entre dos formas principales de acceder a los elementos de una `Series`:

#### üîπ `.iloc[]` ‚Üí Indexaci√≥n por posici√≥n

Se usa para acceder a los elementos **seg√∫n su posici√≥n num√©rica**, empezando desde 0.

‚úÖ √ötil cuando no conoces las etiquetas del √≠ndice y solo te importa el orden.

In [41]:
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64

In [42]:
serie_diccionario.iloc[0]   # Primer elemento

10

In [44]:
serie_diccionario.iloc[2]   # Tercer elemento

30

In [45]:
serie_diccionario.iloc[2:5] # No incluye el √∫ltimo valor

pilar    30
laura    50
ana      86
dtype: int64

In [46]:
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64

In [50]:
serie_diccionario.iloc[::2] # Del primer : hasta el √∫ltimo : en pasos de 2

lorena    10
pilar     30
ana       86
dtype: int64

In [51]:
list(serie_diccionario.iloc[::2].values)

[10, 30, 86]

#### üîπ `.loc[]` ‚Üí Indexaci√≥n por etiqueta

Se usa para acceder a los elementos **seg√∫n la etiqueta del √≠ndice**, no la posici√≥n.

‚úÖ Ideal cuando trabajas con datos con nombres, fechas u otras etiquetas como √≠ndice.

In [53]:
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64

In [ ]:
serie_diccionario.loc['laura']   # Accede al valor asociado a la etiqueta 'laura'

50

In [ ]:
serie_diccionario.loc['pilar']   # Accede al valor asociado a la etiqueta 'pilar'

30

In [55]:
serie_diccionario.loc['pilar':'ana']   # Ojo!!! Incluye el √∫ltimo valor!!! -> Caracter√≠stica del loc

pilar    30
laura    50
ana      86
dtype: int64

In [56]:
serie_diccionario

lorena    10
marta     20
pilar     30
laura     50
ana       86
maria     28
dtype: int64

In [57]:
serie_diccionario.loc['lorena':'maria':3] # start:stop:step

lorena    10
laura     50
dtype: int64



## 2. DataFrames en Pandas

Un DataFrame es una estructura de datos bidimensional en forma de tabla, similar a una hoja de c√°lculo. Es una de las estructuras de datos m√°s utilizadas en el an√°lisis de datos con Pandas.

### Caracter√≠sticas de los DataFrames:
*   **Estructura tabular:** Organizados en filas y columnas, donde cada columna representa una variable y cada fila una observaci√≥n.
*   **Flexibilidad:** Pueden contener datos de diferentes tipos (integers, floats, cadenas, fechas, bools, etc.). Las columnas y los √≠ndices pueden tener nombres personalizados.
*   **Operaciones eficientes:** Dise√±ados para realizar operaciones r√°pidas y eficientes en grandes conjuntos de datos.
*   **Facilidad de importaci√≥n y exportaci√≥n:** Pueden leer y escribir datos en diversos formatos como CSV, Excel, JSON, etc..
*   **Indexaci√≥n flexible:** Permiten acceder y manipular datos utilizando diversas t√©cnicas de indexaci√≥n (por posici√≥n, por etiqueta, booleana).

### Creaci√≥n de DataFrames

Podemos crear DataFrames a partir de diversas fuentes, incluyendo diccionarios de listas y listas de diccionarios.

#### DataFrame a partir de un Diccionario de Listas

In [59]:
# Definimos un diccionario de listas
data_diccionario = {
    'Nombre': ['Ana', 'Juan', 'Mar√≠a', 'Pedro'],
    'Edad': [23, 22, 20, 25],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla']
}

In [60]:
# Convertimos el diccionario en DataFrame usando pd.DataFrame()
df_diccionario = pd.DataFrame(data_diccionario)
df_diccionario

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Juan    22  Barcelona
2  Mar√≠a    20   Valencia
3  Pedro    25    Sevilla

In [61]:
type(df_diccionario)

pandas.core.frame.DataFrame

In [65]:
# Mostramos las primeras 3 filas (m√©todo .head())
df_diccionario.head(3) # Por defecto el head devuelve las 5 primeras filas

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Juan    22  Barcelona
2  Mar√≠a    20   Valencia

In [66]:
print(df_diccionario)

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Juan    22  Barcelona
2  Mar√≠a    20   Valencia
3  Pedro    25    Sevilla

In [67]:
display(df_diccionario)

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Juan    22  Barcelona
2  Mar√≠a    20   Valencia
3  Pedro    25    Sevilla

### Diferencia entre `display()` y `print()` en Pandas

- **`display(df)`**: Muestra el DataFrame con formato bonito en HTML (tablas con bordes, colores y scroll si es largo). Es ideal en entornos como **Jupyter Notebook**.

- **`print(df)`**: Muestra el DataFrame como texto plano. Es m√°s b√°sico y se usa en **consolas tradicionales o scripts**.

> ‚úÖ Usa `display(df)` en notebooks para una visualizaci√≥n m√°s clara y legible.

In [69]:
df_diccionario.shape

(4, 3)

In [68]:
print(f"El dataframe tiene {df_diccionario.shape[0]} filas y {df_diccionario.shape[1]} columnas")

El dataframe tiene 4 filas y 3 columnas

In [70]:
df_diccionario.size

12

In [71]:
df_diccionario.columns

Index(['Nombre', 'Edad', 'Ciudad'], dtype='object')



#### DataFrame a partir de una Lista de Diccionarios

In [72]:
# Definimos una lista de diccionarios
data_lista = [
    {'Nombre': 'Ana', 'Edad': 25, 'Ciudad': 'Madrid'},
    {'Nombre': 'Juan', 'Edad': 30, 'Ciudad': 'Barcelona'},
    {'Nombre': 'Mar√≠a', 'Edad': 28, 'Ciudad': 'Valencia'},
    {'Nombre': 'Pedro', 'Edad': 35, 'Ciudad': 'Sevilla'}
]

In [73]:
# Usamos pd.DataFrame() para convertir la lista de diccionarios a DataFrame
df_lista = pd.DataFrame(data_lista)
df_lista

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Juan    30  Barcelona
2  Mar√≠a    28   Valencia
3  Pedro    35    Sevilla

In [ ]:
# Mostramos las √∫ltimas 2 filas (m√©todo .tail())
df_lista.tail(2) # Por defecto el tail devuelve las 5 √∫ltimas filas

  Nombre  Edad    Ciudad
2  Mar√≠a    28  Valencia
3  Pedro    35   Sevilla



### Apertura de Ficheros en Pandas

Pandas ofrece varios m√©todos para leer diferentes tipos de archivos. Los m√°s comunes son `pd.read_csv()`, `pd.read_excel()`, `pd.read_json()`, y `pd.read_pickle()`.

#### `pd.read_csv()`

Lee archivos CSV (Comma Separated Values). Un par√°metro importante es `sep`, que permite especificar el separador si no es una coma (por ejemplo, punto y coma).

In [81]:
# Ejemplo de lectura de un CSV donde las columnas est√°n separadas por comas
df_jobs = pd.read_csv("data/jobs.csv")
df_jobs.head(3)

/var/folders/dc/5lb7jh9x1d317m9p99y8hjm40000gn/T/ipykernel_38029/1575568449.py:2: DtypeWarning: Columns (0,8) have mixed types. Specify dtype option on import or set low_memory=False.
  df_jobs = pd.read_csv("data/jobs.csv")

,id,title,country,location,company,date,description,company_link,experience,keywords
0,1,Frontend Developer,mexico,"Hacienda San Pablo, M√©xico, Mexico",Vox Feed,2019-08-18,Passion for building interfaces that bring the...,NaN,2,web developer
1,2,Desarrollador Web Javascript Jr Zona Interlomas,mexico,"Atizap√°n de Zaragoza, M√©xico, Mexico",ALIA,2019-10-22,"Alia, Empresa Mexicana Enfocada En Brindar Ser...",https://mx.linkedin.com/company/alia?trk=publi...,2,web developer
2,3,Desarrollador web,mexico,"Tlalnepantla, M√©xico, Mexico",Empresa: ACCOFF MANUFACTURERA S.C.,2020-05-11,ODesarrollo de componentes nativos con Javascr...,NaN,2,web developer

In [82]:
df_jobs.shape

(239465, 10)

In [85]:
# Ejemplo de lectura de un CSV donde las columnas est√°n separadas por ';'
# Aqu√≠ es donde usamos el par√°metro 'sep'
df_aire = pd.read_csv("data/aire.csv", sep=";")
df_aire.head()

,provincia,municipio,estacion,magnitud,punto_muestreo,ano,mes,dia,h01,v01,...,h20,v20,h21,v21,h22,v22,h23,v23,h24,v24
0,28,102,1,1,28102001_1_38,2022,1,30,3.0,T,...,NaN,N,NaN,N,NaN,N,NaN,N,NaN,N
1,28,102,1,6,28102001_6_48,2022,1,30,0.2,T,...,NaN,N,NaN,N,NaN,N,NaN,N,NaN,N
2,28,102,1,7,28102001_7_8,2022,1,30,1.0,T,...,NaN,N,NaN,N,NaN,N,NaN,N,NaN,N
3,28,102,1,8,28102001_8_8,2022,1,30,6.0,T,...,NaN,N,NaN,N,NaN,N,NaN,N,NaN,N
4,28,102,1,10,28102001_10_49,2022,1,30,3.0,T,...,NaN,N,NaN,N,NaN,N,NaN,N,NaN,N

In [84]:
df_aire.shape

(160, 56)

In [86]:
df_aire = pd.read_csv("data/aire.csv")
df_aire.head(2)

  provincia;municipio;estacion;magnitud;punto_muestreo;ano;mes;dia;h01;v01;h02;v02;h03;v03;h04;v04;h05;v05;h06;v06;h07;v07;h08;v08;h09;v09;h10;v10;h11;v11;h12;v12;h13;v13;h14;v14;h15;v15;h16;v16;h17;v17;h18;v18;h19;v19;h20;v20;h21;v21;h22;v22;h23;v23;h24;v24
0  28;102;1;1;28102001_1_38;2022;1;30;3;T;3;T;3;T...
1  28;102;1;6;28102001_6_48;2022;1;30;0.2;T;0.1;T...



#### `pd.read_excel()`

Lee archivos de Excel. Es com√∫n especificar la hoja de c√°lculo usando `sheet_name`. Puede requerir la instalaci√≥n de la librer√≠a `openpyxl` (`pip install openpyxl`).

In [87]:
# Ejemplo de lectura de un archivo Excel
df_xlsx = pd.read_excel("data/espacios_protegidos.xlsx", sheet_name=0)
df_xlsx.head(2)

,espacio_prot_categoria,espacio_prot_figura,espacio_prot_nombre,espacio_prot_superficie_ha,espacio_prot_fecha_declaracion,espacio_prot_normativa,espacio_prot_informacion_web
0,√Åreas protegidas por instrumentos internacionales,Reserva de la Biosfera,"Cuencas Altas de los r√≠os Manzanares, Lozoya y...",105655.0,1992-11-09,Normativa √Åreas protegidas por instrumentos in...,Reserva de la Biosfera Cuencas Altas de los r√≠...
1,√Åreas protegidas por instrumentos internacionales,Reserva de la Biosfera,Sierra del Rinc√≥n,15231.0,2005-06-29,Normativa √Åreas protegidas por instrumentos in...,Reserva de la Biosfera Sierra del Rinc√≥n



#### `pd.read_json()`

Lee archivos JSON. Los archivos JSON pueden tener estructuras complejas, a veces anidadas.

In [88]:
# Ejemplo de lectura de un archivo JSON
df_residuos = pd.read_json("data/residuos.json")
df_residuos.head(2)

                                                data
0  {'residuos_pelig_cantidad_ton': 23476.42, 'res...
1  {'residuos_pelig_cantidad_ton': 1927.25, 'resi...

In [89]:
import json

# Abre el archivo y carga su contenido
with open("data/residuos.json", 'r', encoding='utf-8') as f:
    data = json.load(f)

In [ ]:
data

In [ ]:
data['data']

In [92]:
df_residuos_json = pd.DataFrame(data['data'])
df_residuos_json.head(3)

,residuos_pelig_cantidad_ton,residuos_pelig_a√±o,residuos_pelig_opcion_gestion,residuos_pelig_tratamiento
0,23476.42,2012,Reciclado,Recuperaci√≥n de disolventes
1,1927.25,2012,Reciclado,Recuperaci√≥n de metales
2,25333.54,2012,Reciclado,Regeneraci√≥n de aceite

In [93]:
# Si el JSON contiene diccionarios anidados, se puede aplanar usando .apply(pd.Series)
df_residuos2 = df_residuos['data'].apply(pd.Series)
df_residuos2.head(3)

,residuos_pelig_cantidad_ton,residuos_pelig_a√±o,residuos_pelig_opcion_gestion,residuos_pelig_tratamiento
0,23476.42,2012,Reciclado,Recuperaci√≥n de disolventes
1,1927.25,2012,Reciclado,Recuperaci√≥n de metales
2,25333.54,2012,Reciclado,Regeneraci√≥n de aceite



#### `pd.read_pickle()`

Lee archivos binarios de tipo "pickle". Un archivo pickle se utiliza para serializar (guardar) y deserializar (cargar) objetos de Python, permitiendo almacenar objetos digitales como datos, n√∫meros, listas o diccionarios.

In [94]:
# Ejemplo de lectura de un archivo pickle
df_pkl = pd.read_pickle("data/paises_capitales.pkl")
df_pkl

{'Colombia': 'Bogot√°', 'Ecuador': 'Quito', 'Argentina': 'Buenos'}

## üß† ¬øQu√© es un archivo `.pkl` (Pickle)?

Un archivo `.pkl` es un archivo **binario** que contiene un objeto de Python **serializado**, es decir, convertido en una secuencia de bytes para poder:

* Guardarlo en disco,
* Enviarlo por red,
* O almacenarlo para reutilizarlo luego.

Este proceso se conoce como:

* **Serializaci√≥n**: convertir un objeto en bytes (`pickle.dump()` o `to_pickle()` en pandas)
* **Deserializaci√≥n**: convertir esos bytes de vuelta en el objeto original (`pickle.load()` o `pd.read_pickle()`)

---

## üì¶ ¬øQu√© se puede guardar en un `.pkl`?

Cualquier objeto de Python que sea *picklable*, como:

* Diccionarios
* Listas
* N√∫meros, strings, booleanos
* DataFrames y Series de Pandas
* Modelos entrenados en scikit-learn, por ejemplo

---

## ‚úÖ Uso de `pd.read_pickle()`

```python
import pandas as pd

df = pd.read_pickle('archivo.pkl')
```

Este m√©todo:

* **Carga un DataFrame** guardado previamente con `to_pickle()`
* Es muy r√°pido, m√°s que leer CSV o Excel
* Ideal para guardar versiones intermedias de datasets procesados

---

## ‚úÖ C√≥mo guardar un DataFrame en `.pkl`

```python
df.to_pickle('archivo.pkl')
```

---

## ‚ö†Ô∏è Precauci√≥n con Pickle

* **No uses Pickle para cargar archivos de fuentes no confiables.**

  * Puede ejecutar c√≥digo malicioso al deserializar.
* Est√° pensado para **uso interno en Python**, no para compartir datos entre lenguajes o sistemas.

---

## üìö Comparativa r√°pida

| Formato | Velocidad | Peso  | Legible por humanos | Compartible con otros lenguajes |
| ------- | --------- | ----- | ------------------- | ------------------------------- |
| CSV     | Media     | Alto  | ‚úÖ S√≠                | ‚úÖ S√≠                            |
| JSON    | Media     | Medio | ‚úÖ S√≠                | ‚úÖ S√≠                            |
| Excel   | Lenta     | Medio | ‚úÖ Parcial           | ‚úÖ S√≠                            |
| Pickle  | üèéÔ∏è Alta  | Bajo  | ‚ùå No                | ‚ùå No (solo Python)              |

---



## 3. Indexaci√≥n y Selecci√≥n de Datos en DataFrames: `.loc` e `.iloc`

`loc` e `iloc` son m√©todos fundamentales para acceder y manipular datos en un DataFrame. Ambos se utilizan para la indexaci√≥n, pero de maneras distintas:

*   **`.loc`**: Se utiliza para acceder a los datos **utilizando etiquetas** de fila y columna. Permite seleccionar filas y columnas bas√°ndose en sus nombres o etiquetas.
*   **`.iloc`**: Se utiliza para acceder a los datos **utilizando √≠ndices enteros** de fila y columna (posiciones num√©ricas), similar a c√≥mo se trabaja con listas o arrays de NumPy.

**Diferencias clave:**
*   **Tipo de √≠ndice:** `loc` usa etiquetas (nombres), `iloc` usa posiciones enteras.
*   **L√≠mite superior en rangos:** `loc` **incluye** el l√≠mite superior en los rangos de selecci√≥n, mientras que `iloc` lo **excluye**.

Vamos a cargar un DataFrame de ejemplo para practicar:

In [95]:
# Cargamos el DataFrame 'data.csv'
df = pd.read_csv("data/data.csv")
df.head()

   Day Weather  Temperature  Wind  Humidity
0  Mon   Sunny        12.79    13        30
1  Tue   Sunny        19.67    28        96
2  Wed   Sunny        17.51    16        20
3  Thu  Cloudy        14.44    11        22
4  Fri  Shower        10.51    26        79

In [96]:
# Cargamos el DataFrame 'data.csv' y establecemos 'Day' como √≠ndice
df = pd.read_csv("data/data.csv", index_col=["Day"])
df.head()

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79



### Selecci√≥n a trav√©s de un √∫nico elemento

In [97]:
# Usando .loc: accedemos por los nombres de las filas y las columnas
# Queremos la humedad del martes ('Tue')
df.loc["Tue", "Humidity"]

96

In [98]:
# Usando .iloc: accedemos por los √≠ndices, que empiezan en 0
# 'Tue' es la fila con √≠ndice 1, 'Humidity' es la columna con √≠ndice 3
df.iloc[1, 3]

96



### Selecci√≥n de una fila o una columna completa

Para seleccionar todas las filas o todas las columnas, usamos el s√≠mbolo `:`.

In [100]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [102]:
# Extraer toda la informaci√≥n clim√°tica del martes (toda la fila 'Tue')
# Usando .loc: df.loc[fila_deseada, :]
df.loc["Tue", :]

Weather        Sunny
Temperature    19.67
Wind              28
Humidity          96
Name: Tue, dtype: object

In [103]:
# Usando .iloc: df.iloc[indice_fila_deseada, :]
df.iloc[1, :]

Weather        Sunny
Temperature    19.67
Wind              28
Humidity          96
Name: Tue, dtype: object

In [104]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [105]:
# Extraer la informaci√≥n del viento durante toda la semana (toda la columna 'Wind')
# Usando .loc: df.loc[:, columna_deseada]
df.loc[:, "Wind"]

Day
Mon    13
Tue    28
Wed    16
Thu    11
Fri    26
Sat    27
Sun    20
Name: Wind, dtype: int64

In [106]:
# Usando .iloc: df.iloc[:, indice_columna_deseada]
df.iloc[:, 2]

Day
Mon    13
Tue    28
Wed    16
Thu    11
Fri    26
Sat    27
Sun    20
Name: Wind, dtype: int64



### Selecci√≥n a trav√©s de una lista de valores

Para seleccionar m√∫ltiples filas o columnas no contiguas, se usa una lista de etiquetas o √≠ndices dentro de los corchetes.

In [107]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [108]:
# Extraer el viento del martes ('Tue') y el s√°bado ('Sat')
# Usando .loc: df.loc[[lista_filas], columna_deseada]
df.loc[["Tue", "Sat"], "Wind"]

Day
Tue    28
Sat    27
Name: Wind, dtype: int64

In [109]:
# Usando .iloc: df.iloc[[lista_indices_filas], indice_columna_deseada]
# 'Tue' es √≠ndice 1, 'Sat' es √≠ndice 5, 'Wind' es √≠ndice 2
df.iloc[[1, 5], 2]

Day
Tue    28
Sat    27
Name: Wind, dtype: int64

In [111]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [110]:
# Extraer el viento y la temperatura del martes y el s√°bado
# Usando .loc: df.loc[[lista_filas], [lista_columnas]]
df.loc[["Tue", "Sat"], ["Wind", "Temperature"]]

     Wind  Temperature
Day
Tue    28        19.67
Sat    27        11.07

In [112]:
# Usando .iloc: df.iloc[[lista_indices_filas], [lista_indices_columnas]]
# El viento y la temperatura que hizo el martes y el sabado usando .iloc
# 'Wind' es √≠ndice 2, 'Temperature' es √≠ndice 1
df.iloc[[1, 5],[2, 1]]

     Wind  Temperature
Day
Tue    28        19.67
Sat    27        11.07



### Selecci√≥n de un rango de datos (Corte | Slicing)

Podemos usar la sintaxis de `[start:stop:step]` como en las listas.

In [113]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [114]:
# Extraer la temperatura, el viento y la humedad del jueves ('Thu') y el viernes ('Fri')
# Usando .loc: df.loc[[lista_filas], 'columna_inicio':'columna_fin']
df.loc[['Thu', 'Fri'], 'Temperature':'Humidity']

     Temperature  Wind  Humidity
Day
Thu        14.44    11        22
Fri        10.51    26        79

In [115]:
# Usando .iloc: df.iloc[[lista_indices_filas], indice_columna_inicio:indice_columna_fin]
# 'Thu' es √≠ndice 3, 'Fri' es √≠ndice 4. 'Temperature' es √≠ndice 1, 'Humidity' es √≠ndice 3 (el stop 4 es exclusivo)
df.iloc[[3, 4], 1:4]

     Temperature  Wind  Humidity
Day
Thu        14.44    11        22
Fri        10.51    26        79

In [116]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [117]:
# Extraer todas las condiciones clim√°ticas del lunes, mi√©rcoles y viernes
# Usando .loc con step: df.loc['fila_inicio':'fila_fin':step, :]
df.loc['Mon':'Fri':2, :]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Wed   Sunny        17.51    16        20
Fri  Shower        10.51    26        79

In [119]:
# Usando .iloc con step: df.iloc[indice_inicio:indice_fin:step, :]
# 'Mon' es √≠ndice 0, 'Fri' es √≠ndice 4. Queremos hasta el viernes (√≠ndice 4), pero el 5 es exclusivo, entonces 6 es el stop. El step es 2
df.iloc[:6:2, :]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Wed   Sunny        17.51    16        20
Fri  Shower        10.51    26        79



### Seleccionar basado en una condici√≥n

Podemos filtrar datos usando operadores de comparaci√≥n (`>`, `<`, `>=`, `<=`, `==`, `!=`).

Antes, veamos c√≥mo acceder a una o varias columnas de manera sencilla:

In [120]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [121]:
# Acceder a una sola columna (devuelve una Serie)
df["Temperature"]

Day
Mon    12.79
Tue    19.67
Wed    17.51
Thu    14.44
Fri    10.51
Sat    11.07
Sun    17.50
Name: Temperature, dtype: float64

In [124]:
# Es equivalente a usar la notaci√≥n de punto (si el nombre de la columna no tiene espacios ni caracteres especiales)
df.Temperature

Day
Mon    12.79
Tue    19.67
Wed    17.51
Thu    14.44
Fri    10.51
Sat    11.07
Sun    17.50
Name: Temperature, dtype: float64

In [125]:
# Acceder a varias columnas (devuelve un DataFrame)
# Requiere dos corchetes '[[...]]'
df[["Temperature", "Wind"]]

     Temperature  Wind
Day
Mon        12.79    13
Tue        19.67    28
Wed        17.51    16
Thu        14.44    11
Fri        10.51    26
Sat        11.07    27
Sun        17.50    20



Ahora, filtremos los datos:

In [126]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [127]:
# Filtrar filas donde la temperatura sea mayor que 12¬∞C
# Sintaxis: df.loc[df["columna"] CONDICION] o df.loc[df.columna CONDICION]
df.loc[df.Temperature > 12, :] # Usando el punto

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Sun   Sunny        17.50    20        10

In [128]:
df.loc[df["Temperature"] > 12, :] # Usando corchetes

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Sun   Sunny        17.50    20        10

In [129]:
df.Temperature > 12

Day
Mon     True
Tue     True
Wed     True
Thu     True
Fri    False
Sat    False
Sun     True
Name: Temperature, dtype: bool

In [130]:
# Filtrar con .iloc: requiere convertir la Serie booleana a una lista
# Esto se debe a que iloc no acepta una Serie booleana directamente, solo una lista booleana.
df.iloc[list(df.Temperature > 12), :]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Sun   Sunny        17.50    20        10



#### M√∫ltiples condiciones

Para aplicar varias condiciones, usamos operadores booleanos `&` (AND) o `|` (OR), y las condiciones deben ir entre par√©ntesis.

*   `&`: Todas las condiciones deben cumplirse.
*   `|`: Al menos una de las condiciones debe cumplirse.

In [131]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [132]:
# Seleccionar filas donde el viento es mayor que 20 Y el tiempo es 'Sunny'
# Adem√°s, solo queremos las columnas 'Temperature' y 'Wind'

# Filtrar con .loc: (condicion1) & (condicion2), [columnas_deseadas]
df.loc[(df.Wind > 20) & (df.Weather == 'Sunny'), ['Temperature', 'Wind']]

     Temperature  Wind
Day
Tue        19.67    28

In [133]:
# Filtrar con .iloc: list((condicion1) & (condicion2)), [indices_columnas_deseadas]
# 'Temperature' es √≠ndice 1, 'Wind' es √≠ndice 2
df.iloc[list((df.Wind > 20) & (df.Weather == 'Sunny')),1:3]

     Temperature  Wind
Day
Tue        19.67    28



## 4. Transformaci√≥n y Adici√≥n de Columnas

Como analistas de datos, a menudo necesitamos crear nuevas columnas para transformar, agregar, enriquecer, realizar ingenier√≠a de caracter√≠sticas o facilitar el an√°lisis y la visualizaci√≥n de los datos.

Existen varias formas importantes de crear nuevas columnas en Pandas:

### Asignaci√≥n Directa

Permite asignar una nueva columna utilizando una operaci√≥n o c√°lculo basado en las columnas existentes. Es la forma m√°s sencilla.

In [134]:
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [135]:
# Crear una nueva columna 'Farenheit' convirtiendo 'Temperature' de Celsius a Fahrenheit
# F√≥rmula: (Celsius * 9/5) + 32
df["Farenheit"] = (df["Temperature"] * 9/5) + 32

In [136]:
df

    Weather  Temperature  Wind  Humidity  Farenheit
Day
Mon   Sunny        12.79    13        30     55.022
Tue   Sunny        19.67    28        96     67.406
Wed   Sunny        17.51    16        20     63.518
Thu  Cloudy        14.44    11        22     57.992
Fri  Shower        10.51    26        79     50.918
Sat  Shower        11.07    27        62     51.926
Sun   Sunny        17.50    20        10     63.500



### `.insert()`

El m√©todo `insert()` permite insertar una nueva columna en un DataFrame en una **posici√≥n espec√≠fica**. Requiere la posici√≥n num√©rica (`loc`), el nombre de la nueva columna (`column`), y los valores (`value`). El par√°metro `allow_duplicates` por defecto es `False`, lo que significa que no puedes insertar dos columnas con el mismo nombre.

In [137]:
# En este ejemplo, creamos una columna nueva llamada "indice" en la primera posici√≥n (loc=0)
# con n√∫meros del 1 al 7 (ya que nuestro DataFrame tiene 7 filas)
df.insert(0, "indice", range(1, 8))

In [138]:
df

     indice Weather  Temperature  Wind  Humidity  Farenheit
Day
Mon       1   Sunny        12.79    13        30     55.022
Tue       2   Sunny        19.67    28        96     67.406
Wed       3   Sunny        17.51    16        20     63.518
Thu       4  Cloudy        14.44    11        22     57.992
Fri       5  Shower        10.51    26        79     50.918
Sat       6  Shower        11.07    27        62     51.926
Sun       7   Sunny        17.50    20        10     63.500